;;; Packages
(setq package-archives '(("gnu"   . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
                         ("org-cn". "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
                         ("melpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))



;;; Calendar and time
(package! calfw)
(package! calfw-org)
(package! cal-china-x)

;;; Editing package
(package! cnfonts)
(package! buffer-move)
(package! transpose-frame)
(package! orgtbl-aggregate)
(package! nlinum)


;;; Writting and Drawing
;;;; (package! plantuml-mode)
(package! org-download)


;;; Finance
;;(package! ledger-mode)


;;; Looks and Feels
;;;; themes
;;(package! oceanic-theme)
;;(package! autothemer)
;;(package! zenburn-theme)
;;(package! gruvbox-theme)
;;(package! color-theme-sanityinc-solarized)
;;(package! color-theme-sanityinc-tomorrow)
;;(package! oceanic-theme)

;;;; icons and fonts
(package! all-the-icons)
(package! all-the-icons-dired)
(package! spaceline-all-the-icons)
(package! all-the-icons-gnus)
(package! all-the-icons-ivy)

;;;;; emojs
(package! emojify)


;;; Reading
;;;; epub reading
(package! nov)

;;;; dictionary and referenes
(package! bing-dict)
(package! youdao-dictionary)
(package! pyim)


;;; Writing and Org agenda
;;(package! org-super-agenda)

;;; Programming
(package! ob-async)
(package! highlight-indent-guides)
(package! aggressive-indent)
(package! geiser)
(package! outshine)

;;;; git version control
(package! git-timemachine)

;;;; undo-tree
(package! undo-tree)
(package! ob-async)

;;;; elisp
;;(package! elisp-format)
;;

;;;; scheme
;;(package! geiser)


;; python packages
(package! blacken)
(package! python-environment)
(package! yafolding)







;;; input method
(package! rime)
(package! pyim)

;;; 黑名单
;;dropbox
